target/test-classes/xml/ocs/TC4996_upgrade_ocs_order.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <ord1:createOrder type="UPGRADE" xsi:schemaLocation="http://order.telco.hsntech.com ShopFront.xsd" xmlns:ord1="http://order.telco.hsntech.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <account type="RESIDENTIAL" accountNumber="$accountNumber$"/>
            <verification runCreditCheck="false" termsAndConditionsAccepted="true" refundableDepositAccepted="false" acceptAgreement="true">
                <interconnect>
                    <param name="PAYASYOUGO"/>
                </interconnect>
            </verification>
            <orderDetail orderRef="12345" ipAddress="160.206.234.22" salesChannel="Onlines" externalSystemID="COCO" devicePrint="DEVICEPRINT-AA" paymentMethod="CARD">
                <dateTime>2011-06-10T16:44:31.0Z</dateTime>
                <orderItem id="1" dealSKU="DEAL-INHAND">
                    <serviceRef reference="Mobile 1">$MPN$</serviceRef>
                    <tariff productCode="FC30-1000-100">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </tariff>
                    <device productCode="SIM-ONLY">
                        <deliveryMethod>DELIVER</deliveryMethod>
                    </device>
                    <discBundle productCode="500MB-DATA-500-FC" bundleGroup="STANDARDDATAFC">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </discBundle>
                    <discBundle productCode="02000-SB-A" bundleGroup="SB-GRP-A" billCapNotifications="false">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </discBundle>
                </orderItem>
                <paymentRequest>
                    <cardName>Card</cardName>
                    <cardNumber>5105105105105100</cardNumber>
                    <cardType>MC</cardType>
                    <cardExpiryDate>0328</cardExpiryDate>
                    <cvv>111</cvv>
                </paymentRequest>
            </orderDetail>
        </ord1:createOrder>
    </soapenv:Body>
</soapenv:Envelope>
